from oil_db import *

db = MainDB('oil')

Well("Югра №1", "Oil", 980000000, 4500, [
    {'id': 10, 'from': 0, 'to': 1000},
    {'id': 3, 'from': 1000, 'to': 1430},
    {'id': 2, 'from': 1430, 'to': 1982},
    {'id': 11, 'from': 1982, 'to': 2648},
    {'id': 6, 'from': 2648, 'to': 3312},
    {'id': 7, 'from': 3312, 'to': 3839},
    {'id': 1, 'from': 3839, 'to': 4450}
])

Well("Татарстан №12", "Oil", 1080000000, 4230, [
    {'id': 9, 'from': 0, 'to': 755},
    {'id': 11, 'from': 755, 'to': 1523},
    {'id': 3, 'from': 1523, 'to': 2280},
    {'id': 6, 'from': 2280, 'to': 2916},
    {'id': 10, 'from': 2916, 'to': 3727},
    {'id': 1, 'from': 3727, 'to': 4230}
])
